In [57]:
import pandas as pd

In [58]:
# 2 Main DataTypes

# Series

In [59]:
# Series = 1-dimensional

In [60]:
series = pd.Series(["BMW", "Tesla","Nissan"])

In [61]:
series #

0       BMW
1     Tesla
2    Nissan
dtype: object

In [62]:
colours = pd.Series(["Red","Green","Yellow"])
colours

0       Red
1     Green
2    Yellow
dtype: object

# DataFrames

In [63]:
# DataFrames = 2-dimensional

In [64]:
car_data = pd.DataFrame({"Car Brand":series,"Colour":colours})
car_data

  Car Brand  Colour
0       BMW     Red
1     Tesla   Green
2    Nissan  Yellow

In [65]:
#Import Data
car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [66]:
# Exporting DataFrames

#car_sales.to_csv("Exported_Car_Sales.csv")

In [67]:
Imported_car_sales = pd.read_csv("car-sales.csv")
Imported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Describing Data

In [68]:
#Attribute
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [69]:
#Function
#car_sales.to_csv()

In [70]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [71]:
car_columns = car_sales.columns # show the first row (name of every column)
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [72]:
car_sales.index # describes the index

RangeIndex(start=0, stop=10, step=1)

In [73]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [74]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [75]:
car_prices = pd.Series([1000,52000,1500,6900])
car_prices

0     1000
1    52000
2     1500
3     6900
dtype: int64

In [76]:
car_prices.mean()

15350.0

In [77]:
car_prices.sum()

61400

In [78]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [79]:
car_sales["Doors"].sum()

40

In [80]:
len(car_sales) #how many rows

10

# Viewing and Selecting Data

In [81]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [82]:
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [83]:
car_sales.tail(5)

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [84]:
# loc & iloc

Valorant_Characters = pd.Series(["Sova","Reyna","Viper","Neon","Phoenix","Raze"],index=[1,3,7,4,6,7])
Valorant_Characters

1       Sova
3      Reyna
7      Viper
4       Neon
6    Phoenix
7       Raze
dtype: object

In [85]:
Valorant_Characters.loc[7] # loc---> assigned index - is like iloc by default

7    Viper
7     Raze
dtype: object

In [86]:
car_sales.loc[6]

Make                 Honda
Colour                Blue
Odometer (KM)        45698
Doors                    4
Price            $7,500.00
Name: 6, dtype: object

In [87]:
#iloc

Valorant_Characters.iloc[2] # Real Position

'Viper'

In [88]:
Valorant_Characters.iloc[:3]

1     Sova
3    Reyna
7    Viper
dtype: object

In [89]:
car_sales.Colour

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [90]:
car_sales["Colour"]

0    White
1      Red
2     Blue
3    Black
4    White
5    Green
6     Blue
7     Blue
8    White
9    White
Name: Colour, dtype: object

In [91]:
#car_sales.Colour is the same as car_sales["Colour"] #N.B the first one shouldnt have space in it

In [92]:
car_sales[car_sales["Make"] == "Toyota"] # only want rows that have toyota in it

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [93]:
car_sales[car_sales["Odometer (KM)"]> 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [96]:
pd.crosstab(car_sales.Make,car_sales.Doors)

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [107]:
# Groupby
car_sales.groupby(["Make"]).mean() #gives us the mean of every number in the DatFrame, and the rows are based by every Brand (Make)

C:\Users\Anass\AppData\Local\Temp\ipykernel_1860\3716249449.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  car_sales.groupby(["Make"]).mean() #gives us the mean of every number in the DatFrame, and the rows are based by every Brand (Make)

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75